<?php
// Copyright (c) 2003-2010, CKSource - Frederico Knabben. All rights reserved.
// For licensing, see LICENSE.html or http://ckfinder.com/license

//  Defines the object, for the English language. This is the base file for all translations.

// Korean language file. (20101110 Jeong Hyeok)
$GLOBALS['CKFLang'] = array (
	'ErrorUnknown' => '잘못된 요청으로 처리가 불가능합니다. (에러 %1)',
	'Errors' => array (
		'10' => '잘못된 명령.',
		'11' => '리소스 형식 요청에 지정되지 않았습니다.',
		'12' => '요청한 리소스의 유형이 유효하지 않습니다.',
		'102' => '잘못된 파일 또는 폴더 이름.',
		'103' => '승인되지 않은 요청이므로 불가능 합니다.',
		'104' => '파일 시스템 권한이 없으므로 불가능 합니다.',
		'105' => '잘못된 파일 확장명.',
		'109' => '잘못된 요청.',
		'110' => '알수없는 오류.',
		'115' => '파일이나 폴더에 동일한 이름이 이미 존재합니다.',
		'116' => '폴더를 찾을 수 없습니다. 새로고침 및 다시 시도하십시오.',
		'117' => '파일을 찾을 수 없습니다. 파일 목록을 새로고침 및 다시 시도하십시오.',
		'118' => '원본과 대상 경로가 동일합니다.',
		'201' => '동일한 이름을 가진 파일이 이미 사용중입니다. 업로드된 파일명이 "%1" 로 변경되었습니다.',
		'202' => '잘못된 파일',
		'203' => '잘못된 파일. 파일 크기가 너무 큽니다.',
		'204' => '업로드된 파일이 손상되었습니다.',
		'205' => '임시 폴더는 서버에 업로드하기 위해 사용할 수 없습니다.',
		'206' => '보안상 업로드가 취소되었습니다. 파일에 HTML이 포함되어 있습니다.',
		'207' => '업로드된 파일은 "%1" 로 변경되었습니다.',
		'300' => '파일(들) 이동에 실패했습니다.',
		'301' => '파일(들) 복사에 실패했습니다.',
		'500' => '보안상 파일 브라우저를 사용할 수 없습니다. 시스템 관리자에게 문의하여 CKFinder 환경설정 파일을 확인하시기 바랍니다.',
		'501' => '미리보기를 지원하지 않습니다.'
	)
);
